<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Downloads and installs the latest version of Helicon Focus and Helicon 3D Viewer, bypassing version checks.</string>
    <key>Description</key>
    <string>Downloads and installs the latest version of Helicon Focus, including both HeliconFocus.app and Helicon3DViewer.app, and forces installation regardless of existing version.</string>
    <key>Identifier</key>
    <string>com.github.TekTekkers.munki.HeliconFocus</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>HeliconFocus</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Helicon Focus is an advanced focus stacking software, also includes Helicon 3D Viewer.</string>
            <key>developer</key>
            <string>Helicon Soft s.r.o.</string>
            <key>display_name</key>
            <string>HeliconFocus and Helicon3DViewer</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>version</key>
            <string>8.2.3</string> <!-- Update as needed based on release tracking -->
            <key>unattended_install</key>
            <true/>
            <key>preinstall_script</key>
            <string>#!/bin/bash
# Remove any existing Helicon Focus and Helicon 3D Viewer apps before installing the new version
if [ -d "/Applications/HeliconFocus.app" ]; then
    /bin/rm -rf "/Applications/HeliconFocus.app"
fi
if [ -d "/Applications/Helicon3DViewer.app" ]; then
    /bin/rm -rf "/Applications/Helicon3DViewer.app"
fi</string>
            <key>install_check_script</key>
            <string>#!/bin/bash
# Always return success to bypass version checking
exit 0</string>
            <key>uninstall_check_script</key>
            <string>#!/bin/bash
# Always return success to bypass version checking
exit 0</string>
            <key>update_forced_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.TekTekkers.download.HeliconFocus</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/HeliconFocus.app</string>
                <key>requirement</key>
                <string>identifier "com.heliconsoft.heliconfocus" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Y77YTV6QP3</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Helicon3DViewer.app</string>
                <key>requirement</key>
                <string>identifier "com.heliconsoft.Helicon3DViewer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Y77YTV6QP3</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
