<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages Helicon Focus and Helicon 3D Viewer for Munki.</string>
    <key>Identifier</key>
    <string>com.github.tektekkers.munki.heliconfocus</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HeliconFocus</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/HeliconFocus</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Helicon Focus is an advanced focus stacking software, including Helicon 3D Viewer for 3D visualization.</string>
            <key>developer</key>
            <string>Helicon Soft s.r.o.</string>
            <key>display_name</key>
            <string>HeliconFocus</string>
            <key>name</key>
            <string>HeliconFocus</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.tektekkers.download.heliconfocus</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
