<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Downloads and installs the latest version of Helicon Focus and Helicon 3D Viewer, removing any previous installations using pkgutil.</string>
    <key>Description</key>
    <string>Downloads and installs the latest version of Helicon Focus, including both HeliconFocus.app and Helicon3DViewer.app, and removes previous installations if detected using pkgutil.</string>
    <key>Identifier</key>
    <string>com.github.TekTekkers.munki.HeliconFocus</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>HeliconFocus</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Helicon Focus is an advanced focus stacking software that also includes Helicon 3D Viewer.</string>
            <key>developer</key>
            <string>Helicon Soft s.r.o.</string>
            <key>display_name</key>
            <string>HeliconFocus and Helicon3DViewer</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>version</key>
            <string>8.2.17</string> <!-- Update this version manually as needed -->
            <key>unattended_install</key>
            <true/>
            <key>preinstall_script</key>
            <string>#!/bin/bash
# Check if Helicon Focus or Helicon 3D Viewer is installed using pkgutil and remove them if found

# Paths to the applications
HELICON_FOCUS_PATH="/Applications/HeliconFocus.app"
HELICON_3DVIEWER_PATH="/Applications/Helicon3DViewer.app"

# Use pkgutil to check for receipts
HELICON_FOCUS_RECEIPT=$(pkgutil --pkgs | grep -i "com.heliconsoft.heliconfocus")
HELICON_3DVIEWER_RECEIPT=$(pkgutil --pkgs | grep -i "com.heliconsoft.Helicon3DViewer")

# Remove the applications if they are present
if [ -n "$HELICON_FOCUS_RECEIPT" ] || [ -d "$HELICON_FOCUS_PATH" ]; then
    echo "Removing existing Helicon Focus installation..."
    /bin/rm -rf "$HELICON_FOCUS_PATH"
    if [ -n "$HELICON_FOCUS_RECEIPT" ]; then
        pkgutil --forget "$HELICON_FOCUS_RECEIPT"
    fi
fi

if [ -n "$HELICON_3DVIEWER_RECEIPT" ] || [ -d "$HELICON_3DVIEWER_PATH" ]; then
    echo "Removing existing Helicon 3D Viewer installation..."
    /bin/rm -rf "$HELICON_3DVIEWER_PATH"
    if [ -n "$HELICON_3DVIEWER_RECEIPT" ]; then
        pkgutil --forget "$HELICON_3DVIEWER_RECEIPT"
    fi
fi</string>
            <key>install_check_script</key>
            <string>#!/bin/bash
# Use pkgutil to check if either Helicon Focus or Helicon 3D Viewer is already installed

if [ -d "/Applications/HeliconFocus.app" ] || [ -d "/Applications/Helicon3DViewer.app" ]; then
    echo "Helicon Focus or Helicon 3D Viewer is already installed."
    exit 1
else
    exit 0
fi</string>
            <key>uninstall_check_script</key>
            <string>#!/bin/bash
# Check if the applications exist for uninstall purposes

if [ -d "/Applications/HeliconFocus.app" ] || [ -d "/Applications/Helicon3DViewer.app" ]; then
    exit 0
else
    exit 1
fi</string>
            <key>update_forced_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.TekTekkers.download.HeliconFocus</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/HeliconFocus.app</string>
                <key>requirement</key>
                <string>identifier "com.heliconsoft.heliconfocus" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Y77YTV6QP3</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Helicon3DViewer.app</string>
                <key>requirement</key>
                <string>identifier "com.heliconsoft.Helicon3DViewer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Y77YTV6QP3</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
