<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Helicon3DViewer.</string>
    <key>Identifier</key>
    <string>com.github.TekTekkers.download.Helicon3DViewer</string>
    <key>ParentRecipe</key>
    <string>com.github.TekTekkers.download.HeliconFocus</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Helicon3DViewer</string>
        <key>helicon3dviewer_version</key>
        <string>helicon3dviewer</string>
        <key>helicon3dviewer_app</key>
        <string>Marathon</string>
        <key>helicon3dviewer_version_file</key>
        <string>Helicon3DViewer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
    </array>
</dict>
</plist>
