<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Helicon3DViewer.</string>
    <key>Identifier</key>
    <string>com.github.TekTekkers.download.Helicon3DViewer</string>
    <key>ParentRecipe</key>
    <string>com.github.TekTekkers.download.HeliconFocus</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Helicon3DViewer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Helicon3DViewer.app</string>
				<key>requirement</key>
				<string>identifier "com.heliconsoft.Helicon3DViewer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = B7VP29TH87</string>
				<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
                <true />
			</dict>
		</dict>
    <array>
    </array>
</dict>
</plist>
